Repository: DISCOOS/ringdrill
Catalog: lib/l10n/app_*.arb
Languages: nb

# shareSuccess
source: Shared "{name}" successfully!
nb: Deling av "{name}" var vellykket!

# shareFailure
source: Sharing "{name}" failed. Please try again.
nb: Deling mislyktes. Prøv igjen.

source: Storage
nb: Lagring

source: Documents
nb: Dokumenter

source: Downloads
nb: Nedlastinger

source: SD Card
nb: SD kort

source: SELECT
nb: Velg

source: CANCEL
nb: Avbryt

source: Enter File Name
nb: Skriv inn filnavn

# fileNameHint
source: MyProgram
nb: f.eks., MittProgram

# invalidFileName
source: Invalid file name. Please try again.
nb: Ugyldig filnavn. Prøv igjen.

source: Exported Program
nb: Eksportert Program

# exportSuccess
source: Export to "{name}" was successful!
nb: Eksport til "{name}" var vellykket!

# exportFailure
source: Export to "{name}" failed. Please try again.
nb: Eksporten mislyktes. Prøv igjen.

# selectDirectory
source: Select a directory
nb: Velg en mappe

source: Select file
nb: Velg en fil

# importSuccess
source: Program "{name}" imported successfully!
nb: Program "{name}" ble importert.

# importFailure
source: Failed to import "{name}". Please try again.
nb: Kunne ikke importere programmet. Prøv igjen.

# importProgram
source: Import...
nb: Importer...

# exportProgram
source: Export...
nb: Eksporter...

source: Schedule
nb: Plan

# exercise
source: {count, plural, =0{Exercise} =1{Exercise} other{Exercises}}
nb: {count, plural, =0{Øvelse} =1{Øvelse} other{Øvelser}}

# round
source: {count, plural, =0{Round} =1{Round} other{Rounds}}
nb: {count, plural, =0{Runde} =1{Runde} other{Runder}}

# station
source: {count, plural, =0{Station} =1{Station} other{Stations}}
nb: {count, plural, =0{Post} =1{Post} other{Poster}}

# team
source: {count, plural, =0{Team} =1{Team} other{Teams}}
nb: {count, plural, =0{Lag} other{Lag}}

source: Team rotations
nb: Lagrulleringer

# stationRotations
source: Rotation on stations
nb: Postrulleringer

source: Create Exercise
nb: Opprett øvelse

source: Edit Exercise
nb: Endre øvelse

source: SAVE
nb: LAGRE

# appDescription
source: RingDrill makes it easy to plan and manage station-based ring exercises – commonly used in tactical, emergency, or operational training scenarios.
nb: RingDrill gjør det enkelt å planlegge og administrere postbaserte ringøvelser – som ofte brukes i taktiske, nød- eller operative treningsscenarioer.

source: Developed By
nb: Utviklet av

source: Website
nb: Nettside

source: Privacy Policy
nb: Personvernerklæring

source: Terms Of Service
nb: Brukervilkår

source: Contact Support
nb: Kontakt brukerstøtte

source: App Analytics Consent
nb: Samtykke til appanalyse

# appAnalyticsConsentMessage
source: We use analytics to improve the app experience by collecting crash reports and general usage data from your device.
nb: Vi bruker analyser for å forbedre appopplevelsen ved å samle inn krasjrapporter og generelle bruksdata fra enheten din.

# appAnalyticsConsentOptIn
source: You can choose whether to enable this feature now or later in the settings.
nb: Du kan velge om du vil aktivere denne funksjonen nå eller senere i innstillingene.

# appAnalyticsConsentCollectedData
source: This includes information about your device (e.g., device model, OS version) and crash reports in case of failures. This data is sent to and processed by Sentry.io.
nb: Dette inkluderer informasjon om enheten din (f.eks. enhetsmodell, OS-versjon) og krasjrapporter i tilfelle feil. Disse dataene sendes til og behandles av Sentry.io.

source: Learn More About Data Collected
nb: Lær mer om innsamlede data

source: Allow App Analytics
nb: Tillat appanalyse

# allowAppAnalyticsMessage
source: Enable collection of analytics and crash reports. This data is linked to your device, but not your identity.
nb: Aktiver innsamling av analyser og krasjrapporter. Disse dataene er knyttet til enheten din, men ikke identiteten din.

source: CONFIRM
nb: BEKREFT

# confirmDeleteExercise
source: This will delete the exercise. Do you want to continue?
nb: Dette vil slette øvelsen. Vil du fortsette?

source: YES
nb: JA

source: NO
nb: NEI

source: ALLOW
nb: TILLAT

source: DECLINE
nb: AVSLÅ

source: Station Name
nb: Postnavn

# stationNameHint
source: Name this station
nb: Gi posten et navn

source: Edit Station
nb: Endre post

source: Station Description
nb: Postbeskrivelse

# stationDescriptionHint
source: Give a description of how this station should be executed
nb: Gi en beskrivelse av hvordan denne posten skal utføres

# notification
source: {count, plural, =0{Notification} =1{Notification} other{Notifications}}
nb: {count, plural, =0{Varsel} =1{Varsel} other{Varsler}}

# toggleNotificationDescription
source: Enable or disable local notifications for reminders and updates while using the app. Disabling this will stop sending all notifications immediately.
nb: Aktiver eller deaktiver lokale varsler for påminnelser og oppdateringer mens du bruker appen. Hvis du deaktiverer dette, stoppes sendingen av alle varsler umiddelbart.

source: Enable Notifications
nb: Aktiver varsler

# enableNotificationsMessage
source: When enabled, you will receive reminders and updates via notifications.
nb: Når det er aktivert, vil du motta påminnelser og oppdateringer via varsler.

source: Set Urgent Notification Threshold
nb: Angi terskel for hastevarsling

# setUrgentNotificationThresholdDescription
source: The number of minutes remaining before the next phase to show an urgent notification.
nb: Antall minutter som gjenstår før neste fase for å vise et hastevarsel.

source: Full-Screen Notifications
nb: Fullskjerm varlser

# fullScreenNotificationsDescription
source: Allow notifications to appear in full-screen mode for urgent updates, even when other apps are open.
nb: Tillat at varsler vises i fullskjermmodus for hastevarsler, selv når andre apper er åpne.

source: Play Sound when urgent
nb: Spill av lyd når det haster

# playSoundWhenUrgentDescription
source: Toggle notification sounds on or off on urgent notifications.
nb: Slå varslingslyder av eller på for hastevarsler.

source: Vibrate when urgent
nb: Vibrer når det haster

# vibrateWhenUrgentDescription
source: Enable or disable vibration for urgent notifications.
nb: Aktiver eller deaktiver vibrasjon for hastevarsler.

source: Position
nb: Posisjon

source: Settings
nb: Innstillinger

source: About
nb: Om

source: Version
nb: Versjon

source: No exercises yet!
nb: Ingen øvelser ennå!

source: Stop Exercise
nb: Stop øvelse

source: No rounds scheduled!
nb: Ingen runder planlagt!

source: Show notification
nb: Vis varsel

source: Open notification
nb: Åpne varsel

# exerciseNotifications
source: Show notification
nb: Vis varsel

source: Stop {exercise} first!
nb: Stop {exercise} først!

source: No location
nb: Ingen posisjon oppgitt

source: No description
nb: Ingen beskrivelse oppgitt

source: Exercise Name
nb: Øvingsnavn

source: Please enter a name
nb: Oppgi navn på øvelse

source: Start Time
nb: Starttid

source: Number of Rounds
nb: Antall runder

source: Number of Teams
nb: Antall lag

# mustBeEqualToOrLessThanNumberOf
source: Must be equal or less than {name}
nb: Må være lik eller mindre enn antall {name}

source: Please enter a valid number
nb: Oppgi et nummer

source: Update required
nb: Oppdater

source: New patch is available
nb: Ny oppdatering er tilgjengelig

source: Restart app to apply new patch
nb: Start appen på nytt for ny oppdatering

source: App updated, restarting...
nb: Appen er oppdatert, starter på nytt...

# appUpdatedPleaseCloseAndOpen
source: App updated, please close app and open again
nb: Appen er oppdatert. Lukk appen og åpne den igjen.

source: Search for place or location
nb: Søk etter sted eller posisjon

# searchFailed
source: Search failed: {error}
nb: Søk feilet: {error}

source: Pick a Location
nb: Velg plassering

source: Switch to OSM
nb: Bytt til OSM

source: Switch to Topo
nb: Bytt til Topo

# selectAction
source: Select
nb: Velg

source: Analytics Enabled
nb: Appanalyse er aktivert

source: Analytics Disabled
nb: Appanalyse er deaktivert

# analyticsIsAllowed
source: You have agreed to allow analytics data to be collected from your device.
nb: Appanalyse er tillatt

# analyticsIsDenied
source: You have opted out of analytics. No data will be collected from your device.
nb: Appanalyse er ikke tillatt

source: Execution Time
nb: Øvingstid

source: Evaluation Time
nb: Evalueringstid

source: Rotation Time
nb: Rulleringstid

source: Please enter a valid time
nb: Oppgi tid

source: Pending
nb: Venter

source: Execution
nb: Øving

source: Evaluation
nb: Evaluering

source: Rotation
nb: Rullering

# second
source: {count} sec
nb: {count} sek

# hour
source: {count, plural, =0{now} =1{1 hour} other{{count} hours}}
nb: {count, plural, =0{nå} =1{1 time} other{{count} timer}}

# day
source: {count, plural, =0{now} =1{1 day} other{{count} days}}
nb: {count, plural, =0{nå} =1{1 dag} other{{count} dager}}

# week
source: {count, plural, =0{now} =1{1 week} other{{count} weeks}}
nb: {count, plural, =0{nå} =1{1 uke} other{{count} uker}}

# month
source: {count, plural, =0{now} =1{1 month} other{{count} months}}
nb: {count, plural, =0{nå} =1{1 måned} other{{count} måneder}}

# year
source: {count, plural, =0{now} =1{1 year} other{{count} years}}
nb: {count, plural, =0{nå} =1{1 år} other{{count} år}}

# minutesLeft
source: {count} min left
nb: {count} min igjen

# timeToNext
source: {time} next
nb: {time} neste

source: is running
nb: kjører

source: is pending
nb: venter

source: is done
nb: er ferdig

source: Wait
nb: Vent

source: Drill
nb: Øve

source: Roll
nb: Rull

source: Done
nb: Ferdig
